Q1. List any five functions of the pandas library with execution.

In [20]:
import pandas as pd

1)read_csv

In [2]:
df=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [3]:
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

2)head

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

3)Tail

In [5]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

4)Info

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

5)Describe

In [7]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
import pandas as pd

def reindex_dataframe(df):
    new_index= range(1,2*len(df)+1,2)
    
    df=df.set_index(pd.Index(new_index))
    return df


data={
    'A':[10,20,30],
    'B':[20,30,40],
    'C':[30,40,50]}
df=pd.DataFrame(data)

df=reindex_dataframe(df)

print(df)

    A   B   C
1  10  20  30
3  20  30  40
5  30  40  50

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [90]:
data1={'Values':[10,20,30,40,50]}
df1=pd.DataFrame(data1)

In [91]:
print(df1)

   Values
0      10
1      20
2      30
3      40
4      50

In [92]:
type(df1)

pandas.core.frame.DataFrame

In [24]:
df1['Values']

0    10
1    20
2    30
3    40
4    50
Name: Values, dtype: int64

In [30]:
def calculate_sum(df):
    if 'Values' in df1.columns:
        sum=df1['Values'].head(3).sum()
        print('The sum of first three numbers is:',sum)
    
    else:
        print("Values does not exist")

In [31]:
calculate_sum(df1)

The sum of first three numbers is: 60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [78]:
data1={
    'Text':['Amar is  good Boy','Annu is nice','Aman is a Star']}

In [79]:
df2=pd.DataFrame(data1)

In [80]:
df2[['Text']]

                Text
0  Amar is  good Boy
1       Annu is nice
2     Aman is a Star

In [84]:
df2['WordCount']=df2['Text'].apply(lambda x: len(str(x).split()))

In [85]:
df2

                Text  WordCount
0  Amar is  good Boy          4
1       Annu is nice          3
2     Aman is a Star          4

Q5. How are DataFrame.size() and DataFrame.shape() different?

In Pandas, DataFrame.size and DataFrame.shape are both attributes that provide information about the structure of a DataFrame, but they serve different purposes and return different information:

DataFrame.size:

DataFrame.size returns the total number of elements in the DataFrame, which is equivalent to the product of the number of rows and the number of columns.
It returns a single integer representing the size of the entire DataFrame.

In [100]:
df3=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
size=df3.size
print(size)

6

DataFrame.shape:

DataFrame.shape returns a tuple that contains two elements. The first element is the number of rows, and the second element is the number of columns in the DataFrame.
It provides a more detailed breakdown of the DataFrame's dimensions.

In [102]:
shape=df3.shape
print(shape)

(3, 2)

Q6. Which function of pandas do we use to read an excel file?

To read an Excel file in Pandas, you can use the read_excel() function.

In [106]:
df4=pd.read_excel('2200520139-Amar Kumar Pathak.xlsx')

In [107]:
print(df4)

                                           Unnamed: 0 Unnamed: 1 Unnamed: 2  \
0                                                 NaN        NaN        NaN
1                                                 NaN        NaN        NaN
2                                                 NaN        NaN        NaN
3                                                 NaN        NaN        NaN
4   COUNSELLING BOOK- MAINTAINING THE DETAILS OF C...        NaN        NaN
..                                                ...        ...        ...
70                                                NaN         4)        NaN
71                                                NaN         5)        NaN
72                                                NaN        NaN        NaN
73                                                NaN        NaN        NaN
74                                                NaN        NaN        NaN

   Unnamed: 3                                         Unnamed: 4 Unnamed: 5  \
0         NaN                                                NaN        NaN
1         NaN                                                NaN        NaN
2         NaN                                                NaN        NaN
3         NaN                                                NaN        NaN
4         NaN                                                NaN        NaN
..        ...                                                ...        ...
70        NaN                                                NaN        NaN
71        NaN                                                NaN        NaN
72        NaN                                                NaN        NaN
73        NaN                                                NaN        NaN
74        NaN  SIGNATURE OF THE COUNSELLOR :\nNAME OF THE COU...        NaN

    Unnamed: 6
0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
..         ...
70         NaN
71         NaN
72         NaN
73         NaN
74         NaN

[75 rows x 7 columns]

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [108]:
    df5=pd.DataFrame({'Email':['amarkumarpathak2004@gmail.com','xyz@yahoo.com','pathakboss78@gmail.com']})

In [109]:
df5

                           Email
0  amarkumarpathak2004@gmail.com
1                  xyz@yahoo.com
2         pathakboss78@gmail.com

In [118]:
df5['Username']=df5['Email'].str.split('@')

In [119]:
df5

                           Email                          Username
0  amarkumarpathak2004@gmail.com  [amarkumarpathak2004, gmail.com]
1                  xyz@yahoo.com                  [xyz, yahoo.com]
2         pathakboss78@gmail.com         [pathakboss78, gmail.com]

In [116]:
df5['Username']=df5['Email'].str.split('@').str[0]

In [117]:
df5

                           Email             Username
0  amarkumarpathak2004@gmail.com  amarkumarpathak2004
1                  xyz@yahoo.com                  xyz
2         pathakboss78@gmail.com         pathakboss78


Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [121]:
df6=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [122]:
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [124]:
selected=df6[(df6['A']>5) &(df6['B']<10)]

In [125]:
selected

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [126]:
df1.describe()

          Values
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

In [127]:
df1.median()

Values    30.0
dtype: float64

In [128]:
df1.mean()

Values    30.0
dtype: float64

In [129]:
df1.std()

Values    15.811388
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [132]:
df7=pd.DataFrame({'Date':['2023-10-01','2023-10-02','2023-10-03','2023-10-04','2023-10-05','2023-10-06','2023-10-07'],
                  'Sales':[100,150,120,200,180,250,160]})

In [133]:
df7

         Date  Sales
0  2023-10-01    100
1  2023-10-02    150
2  2023-10-03    120
3  2023-10-04    200
4  2023-10-05    180
5  2023-10-06    250
6  2023-10-07    160

In [135]:
df7['Date']=pd.to_datetime(df7['Date'])

In [138]:
df7=df7.sort_values(by='Date')

In [139]:
df7

        Date  Sales
0 2023-10-01    100
1 2023-10-02    150
2 2023-10-03    120
3 2023-10-04    200
4 2023-10-05    180
5 2023-10-06    250
6 2023-10-07    160

In [143]:
df7['MovingAverage']=df7['Sales'].rolling(window=7,min_periods=1).mean()

In [144]:
df7

        Date  Sales  MovingAverage
0 2023-10-01    100     100.000000
1 2023-10-02    150     125.000000
2 2023-10-03    120     123.333333
3 2023-10-04    200     142.500000
4 2023-10-05    180     150.000000
5 2023-10-06    250     166.666667
6 2023-10-07    160     165.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [15]:
import pandas as pd
import datetime as dt
df8=pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})

In [16]:
df8

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [19]:
df8['Date']=pd.to_datetime(df8['Date'])

In [20]:
df8['Weekday']=df8['Date'].dt.strftime('%A')

In [21]:
df8

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [22]:
df9=pd.DataFrame({'Date':['2023-01-01','2023-01-15','2023-01-20','2023-02-05','2023-03-10']})

In [23]:
df9

         Date
0  2023-01-01
1  2023-01-15
2  2023-01-20
3  2023-02-05
4  2023-03-10

In [24]:
start_date='2023-01-01'
end_date='2023-01-31'

In [25]:
start_date=pd.to_datetime(start_date)
end_date=pd.to_datetime(end_date)

In [26]:
df9['Date']=pd.to_datetime(df9['Date'])

In [27]:
selected_date=df9[(df9['Date'] >= start_date) & (df9['Date']<=end_date)]

In [28]:
selected_date

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-20

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [29]:
import pandas as pd

The common convention is to import Pandas with the alias 'pd,' which makes it easier to reference Pandas functions and objects. With this import statement, you'll be able to use Pandas to create DataFrames, manipulate data, perform data analysis, and more.